using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Dothan.ExportData
{
    public enum ESecurityType
    {
        股票,
        封闭式基金,
        国债,
        企债,
        可转债,
        政策性金融债,
        债券回购,
        股票回购,
        企债标准券,
        债转股,
        配债, 
        央行票据, 
        存款, 
        开放式基金, 
        非政策性金融债,
        通用配售权证, 
        买断式回购,
        投票, 
        次级债, 
        次级债务,
        认购权证, 
        认沽权证,
        认购行权,
        认沽行权,
        债券质押, 
        股指期货, 
        公司债, 
        地方债, 
        理财产品, 
        国债期货, 
        项目投资,
        债券认购, 
        信托计划,
        申购,
        申购款,
        配号, 
        增发, 
        增发款, 
        配售, 
        关联配售, 
        配股,
        关联配股, 
        债券承销, 
        债券申购, 
        债券申购款, 
        非标, 
        债券增发, 
        债券增发款, 
        指定登记, 
        撤销指定, 
        回购登记, 
        回购撤销, 
        商品期货, 
        指数, 
        国债标准券, 
        债回售, 
        信用拆借, 
        优先股, 
        优先股回售,
        其他,
        认购期权,
        认沽期权, 
        债券借货, 
        优先股转股,
        基金质押
    }

    public enum EEntrustType
    {
        买入, 
        卖出, 
        转托管, 
        债券买入, 
        债券卖出, 
        融资回购_折入,
        融券回购_折出, 
        提交质押, 
        转回质押, 
        转股, 
        回售, 
        配股认购, 
        申购, 
        认购, 
        ETF基金申购, 
        ETF基金赎回, 
        开基申购, 
        开基赎回, 
        分红设置, 
        基金认购, 
        基金转换, 
        议案投票, 
        预受要约, 
        预受要约撤销, 
        无, 
        融资购回, 
        买入开仓, 
        融券购回, 
        存款, 
        卖出平仓, 
        指定交易, 
        承销买入, 
        行权认购, 
        卖出开仓, 
        项目投资, 
        撤销指定, 
        分销买入, 
        行权认沽, 
        买入平仓, 
        存款支取, 
        分销卖出, 
        盈亏结转, 
        债券投标, 
        债券远期买入, 
        跨市场转托管, 
        债券远期卖出, 
        基金分拆, 
        基金合并, 
        约定购回, 
        基金冲账, 
        担保券交存,
        担保券提取, 
        融资买入, 
        卖券还款, 
        直接还款, 
        融券卖出, 
        买券还券,
        直接还券, 
        债券融出到期, 
        债券融入到期, 
        债券融入, 
        债券融出
    }

    public enum EMarketType
    {
        /// <summary>
        /// 上交所
        /// </summary>
        SH,
        /// <summary>
        /// 深交所
        /// </summary>
        SZ,
        /// <summary>
        /// 金交所
        /// </summary>
        JJ,
        /// <summary>
        /// 所有
        /// </summary>
        ALL
    }
}
